Catalogs/User.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Catalog>
		<Properties>
			<Name>User</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Manager</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.User</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>EMail</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>UserID</Name>
					<Comment>Требуется для сопоставления элемента справочника ВнешниеПользователи пользователю ИБ</Comment>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>UserName</Name>
					<Comment>Для логина выполняется проверка на уникальность в пределах всего справочника</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Role</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Password</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Position</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Positions</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>InterfaceLanguage</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>RoleOfUser</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.RolesOfUsers</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ExternalId</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/User/Ext/ManagerModule.bsl
Procedure ChoiceDataGetProcessing(ChoiceData, Parameters, StandardProcessing)
	
	If Parameters.Property("Role") Then 
		
		If ValueIsFilled(Parameters.Role) Then 
			
			StandardProcessing = False;
			
			EnabledRoles = New Array;
			
			If Parameters.Role = "SRM" Then 
				
				EnabledRoles.Add("SRM");
				EnabledRoles.Add("SRM_SR");
				
			Else 
				
				EnabledRoles.Add("SR");
				EnabledRoles.Add("SRM_SR");
				
			EndIf;
			
			Query = New Query;
			Query.Text = 
				"SELECT ALLOWED
				|	User.Ref AS User,
				|	User.Code AS Code,
				|	User.Description AS Description,
				|	User.Description,
				|	User.RoleOfUser.Role AS Role
				|FROM
				|	Catalog.User AS User
				|WHERE
				|	User.RoleOfUser.Role IN(&EnabledRoles)
				|	" + ?(Parameters.SearchString = Undefined, "", "AND (User.Description LIKE &Search OR User.Code LIKE &Search)");
			
			Query.SetParameter("EnabledRoles", EnabledRoles);
			
			If Not Parameters.SearchString = Undefined Then 
				
				Query.SetParameter("Search", "%" + Parameters.SearchString + "%");
				
			EndIf;
			
			QueryResult = Query.Execute();
			
			Selection = QueryResult.Select();
			
			ChoiceData = New ValueList;
			
			While Selection.Next() Do
				
				ChoiceData.Add(Selection.User, Selection.Description + " (" + Selection.Code + ")");
				
			EndDo;
		
			
		EndIf;
		
	EndIf;
	
EndProcedure
